In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from collections import Counter

In [4]:
data = pd.read_csv('movie_bd_v5.csv')
data.sample(10)

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year
899,tt0274558,25000000,108846072,The Hours,Nicole Kidman|Julianne Moore|Meryl Streep|Step...,Stephen Daldry,The time to hide is over. The time to regret i...,"""The Hours"" is the story of three women search...",114,Drama,Paramount Pictures|Miramax Films|Scott Rudin P...,12/27/2002,6.7,2002
1784,tt0484740,45000000,4607608,Love in the Time of Cholera,Javier Bardem|Unax Ugalde|Benjamin Bratt|Catal...,Mike Newell,How long would you wait for love?,"In Colombia just after the Great War, an old m...",139,Drama|Romance,New Line Cinema|Grosvenor Park Media Ltd.,10/4/2007,6.6,2007
308,tt1210042,17000000,29536299,Brooklyn's Finest,Richard Gere|Don Cheadle|Ethan Hawke|Wesley Sn...,Antoine Fuqua,This is War. This is Brooklyn.,Brooklyn's Finest takes place within the notor...,133,Crime|Drama|Thriller,Nu Image Films|Langley Productions|Thunder Roa...,1/16/2009,6.1,2009
993,tt1371111,102000000,130482868,Cloud Atlas,Tom Hanks|Halle Berry|Jim Broadbent|Hugo Weavi...,Lilly Wachowski|Lana Wachowski|Tom Tykwer,Everything is Connected,A set of six nested stories spanning time betw...,172,Drama|Science Fiction,Anarchos Productions|X-Filme Creative Pool|Asc...,10/26/2012,6.5,2012
1065,tt2023453,22000000,77112176,Diary of a Wimpy Kid: Dog Days,Devon Bostick|Steve Zahn|Peyton List|Rachael H...,David Bowers,School's Out for the summer,School is out and Greg is ready for the days o...,94,Comedy|Family,Fox 2000 Pictures,8/2/2012,5.9,2012
1188,tt1798709,23000000,47351251,Her,Joaquin Phoenix|Scarlett Johansson|Rooney Mara...,Spike Jonze,A Spike Jonze Love Story,"In the not so distant future, Theodore, a lone...",126,Romance|Science Fiction|Drama,Annapurna Pictures,12/18/2013,7.8,2013
1661,tt0315824,50000000,6808550,The Big Bounce,Owen Wilson|Morgan Freeman|Gary Sinise|Sara Fo...,George Armitage,It's all in who you trust,A small-time con artist and a Hawaiian real es...,88,Comedy|Crime,Warner Bros. Pictures|Shangri-La Entertainment...,1/30/2004,4.9,2004
819,tt1033575,20000000,177243185,The Descendants,George Clooney|Shailene Woodley|Amara Miller|N...,Alexander Payne,The South Pacific ain't that terrific.,With his wife Elizabeth on life support after ...,115,Comedy|Drama,Fox Searchlight Pictures|Dune Entertainment|Ad...,9/9/2011,6.6,2011
883,tt0258000,48000000,196397415,Panic Room,Jodie Foster|Kristen Stewart|Forest Whitaker|D...,David Fincher,It was supposed to be the safest room in the h...,Trapped in their New York brownstone's panic r...,112,Crime|Drama|Thriller,Columbia Pictures Corporation|Hofflund/Polone|...,3/29/2002,6.4,2002
736,tt1499658,35000000,117000000,Horrible Bosses,Jennifer Aniston|Jason Bateman|Charlie Day|Jas...,Seth Gordon,Ever wish your boss was dead?,"For Nick (Jason Bateman), Kurt (Jason Sudeikis...",98,Comedy|Crime,New Line Cinema|Rat Entertainment,7/8/2011,6.4,2011

In [3]:
data.describe()

             budget       revenue      runtime  vote_average  release_year
count  1.889000e+03  1.889000e+03  1889.000000   1889.000000   1889.000000
mean   5.431083e+07  1.553653e+08   109.658549      6.140762   2007.860773
std    4.858721e+07  2.146698e+08    18.017041      0.764763      4.468841
min    5.000000e+06  2.033165e+06    63.000000      3.300000   2000.000000
25%    2.000000e+07  3.456058e+07    97.000000      5.600000   2004.000000
50%    3.800000e+07  8.361541e+07   107.000000      6.100000   2008.000000
75%    7.200000e+07  1.782626e+08   120.000000      6.600000   2012.000000
max    3.800000e+08  2.781506e+09   214.000000      8.100000   2015.000000

# Предобработка

In [67]:
answers = {} # создадим словарь для ответов

# тут другие ваши предобработки колонок например:
data['namelenght'] = data.original_title.apply(lambda x: len(x))
data['month'] = data.release_date.apply(lambda x: x[0: x.index('/')])

#  (profit = revenue - budget)
def f(x):
    summ = x.revenue - x.budget
    return summ

data['profit']= data.apply(f, axis = 1)

In [ ]:
#  выдает словарь с количеством вхождений каждого эллемента списка
def counts(data):
    dic ={}
    number = data.size
    for i in range(number):
        a = data.iloc[i].split('|')
        for j in range(len(a)):
            if a[j] not in dic :
                dic[a[j]] = 1
            else:
                dic[a[j]] +=1
    return dic

In [112]:
# суммирует в df по столбцу s1  суммы из s2
def summ(df, s1, s2):
    dic = {}
    number = df[s1].size
    for i in range(number):
        if df[s1].iloc[i] not in dic:
            dic[df[s1].iloc[i]] = df[s2].iloc[i]
        else:
            dic[df[s1].iloc[i]] += df[s2].iloc[i]
    return dic

In [147]:
# суммирует в df по каждому эллементу s1 суммы s2
def el_sum(df, s1, s2):
    dic ={}
    number = df[s1].size
    for i in range(number):
        a = df[s1].iloc[i].split('|')
        for j in range(len(a)):
            if a[j] not in dic:
                dic[a[j]] = df[s2].iloc[i]
            else:
                dic[a[j]] += df[s2].iloc[i]
    return dic

In [208]:
# среднее в df значение s2 по кажому эллементу s1

def df_el1_el2(df, s1, s2):
    dlen = {}
    dcount = {}
    dmean = {}
    number = df[s1].size
    for i in range(number):
        a = df[s1].iloc[i].split('|')
        for j in range(len(a)):
            if a[j] not in dic:
                dlen[a[j]] = df[s2].iloc[i]
                dcount[a[j]] = 1
            else:
                dlen[a[j]] += df[s2].iloc[i]
                dcount[a[j]] += 1
    for key in dlen:
        dmean[key] = dlen[key] / dcount[key]
    return dmean

In [223]:
# количество эл-ов в s2 для каждого эл-та s1 в df

def count_s2_numbers(df, s1, s2):
    dlen = {}
    dfilms = {}
    dmean = {}
    for i in range(df[s1].size):
        a = df[s1].iloc[i].split('|')
        w = df[s2].iloc[i].split(" ")
        for j in range(len(a)):
            if a[j] not in dlen :
                dlen[a[j]] = len(w)
                dfilms[a[j]] = 1
            else:
                dlen[a[j]] += len(w)
                dfilms[a[j]] += 1
    for key in dlen:
        dmean[key] = dlen[key] / dfilms[key]
    return dmean

In [345]:
# самая часто встречающаяся пара значений в df  серии  ser, разделитель '|'
def dic_with_pairs(df, ser):
    dic = {}
    wmax = 0
    pair = 0
    answ
    number = df[ser].size
    for i in range(number):
        a = df[ser].iloc[i].split('|')
        for j in range(len(a)):
            for r in range(len(a)):
                if j < r and (a[j] +a[r] not in dic):
                    dic[a[j] + a[r]] = 1
                elif j < r and (a[j] +a[r] in dic):
                    dic[a[j] +a[r]] += 1

    for key, value in dic.items():
        if value > wmax:
            pair = key 
            wmax = value
        
    return pair

# 1. У какого фильма из списка самый большой бюджет?

Использовать варианты ответов в коде решения запрещено.    
Вы думаете и в жизни у вас будут варианты ответов?)

In [0]:
# в словарь вставляем номер вопроса и ваш ответ на него
# Пример: 
answers['1'] = '2. Spider-Man 3 (tt0413300)'
# запишите свой вариант ответа
answers['1'] = '...'
# если ответили верно, можете добавить комментарий со значком "+"

In [48]:
film_list = ["The Dark Knight Rises","Spider-Man 3","Avengers: Age of Ultron","The Warrior's Way",'Pirates of the Caribbean: On Stranger Tides']
data2= pd.DataFrame()
for i in range(len(film_list)):
    data2= pd.concat([data2,(data[data.original_title == film_list[i]])])
sorted_data = data2.sort_values(by='budget')

answ = sorted_data[sorted_data.budget == sorted_data.budget.max()]
answers['1'] = answ.original_title
answers

{'1': 723    Pirates of the Caribbean: On Stranger Tides
 Name: original_title, dtype: object}

ВАРИАНТ 2

In [0]:
# можно добавлять разные варианты решения

# 2. Какой из фильмов самый длительный (в минутах)?

In [0]:
# думаю логику работы с этим словарем вы уже поняли, 
# по этому не буду больше его дублировать
answers['2'] = '...'

In [54]:
film_list = ['The Lord of the Rings: The Return of the King','Gods and Generals','King Kong','Pearl Harbor','Alexander']
data2= pd.DataFrame()
for i in range(len(film_list)):
    data2= pd.concat([data2,(data[data.original_title == film_list[i]])])
sorted_data = data2.sort_values(by='runtime')

answ = sorted_data[sorted_data.runtime == sorted_data.runtime.max()]
answers['2'] = answ.original_title
answers

{'1': 723    Pirates of the Caribbean: On Stranger Tides
 Name: original_title, dtype: object,
 '2': 1157    Gods and Generals
 Name: original_title, dtype: object}

# 3. Какой из фильмов самый короткий (в минутах)?

In [57]:
film_list = ['Home on the Range','The Jungle Book 2','Winnie the Pooh','Corpse Bride','Hoodwinked!']
data2= pd.DataFrame()
for i in range(len(film_list)):
    data2= pd.concat([data2,(data[data.original_title == film_list[i]])])
sorted_data = data2.sort_values(by='runtime')
answ = sorted_data[sorted_data.runtime == sorted_data.runtime.min()]
answers['3'] = answ.original_title

In [58]:
answers

{'1': 723    Pirates of the Caribbean: On Stranger Tides
 Name: original_title, dtype: object,
 '2': 1157    Gods and Generals
 Name: original_title, dtype: object,
 '3': 768    Winnie the Pooh
 Name: original_title, dtype: object}

# 4. Какова средняя длительность фильмов?

In [59]:
data.describe()

             budget       revenue      runtime  vote_average  release_year
count  1.889000e+03  1.889000e+03  1889.000000   1889.000000   1889.000000
mean   5.431083e+07  1.553653e+08   109.658549      6.140762   2007.860773
std    4.858721e+07  2.146698e+08    18.017041      0.764763      4.468841
min    5.000000e+06  2.033165e+06    63.000000      3.300000   2000.000000
25%    2.000000e+07  3.456058e+07    97.000000      5.600000   2004.000000
50%    3.800000e+07  8.361541e+07   107.000000      6.100000   2008.000000
75%    7.200000e+07  1.782626e+08   120.000000      6.600000   2012.000000
max    3.800000e+08  2.781506e+09   214.000000      8.100000   2015.000000

In [61]:
answers['4'] =data.runtime.mean()
answers

{'1': 723    Pirates of the Caribbean: On Stranger Tides
 Name: original_title, dtype: object,
 '2': 1157    Gods and Generals
 Name: original_title, dtype: object,
 '3': 768    Winnie the Pooh
 Name: original_title, dtype: object,
 '4': 109.6585494970884}

# 5. Каково медианное значение длительности фильмов?

In [63]:

from statistics import median
 
answers['5'] =median(data.runtime)
answers

{'1': 723    Pirates of the Caribbean: On Stranger Tides
 Name: original_title, dtype: object,
 '2': 1157    Gods and Generals
 Name: original_title, dtype: object,
 '3': 768    Winnie the Pooh
 Name: original_title, dtype: object,
 '4': 109.6585494970884,
 '5': 107}

# 6. Какой самый прибыльный фильм?
#### Внимание! Здесь и далее под «прибылью» или «убытками» понимается разность между сборами и бюджетом фильма. (прибыль = сборы - бюджет) в нашем датасете это будет (profit = revenue - budget)

In [72]:
# лучше код получения столбца profit вынести в Предобработку что в начале
answ = data[data.profit == data.profit.max()]
answers['6'] =answ.original_title
answers

{'1': 723    Pirates of the Caribbean: On Stranger Tides
 Name: original_title, dtype: object,
 '2': 1157    Gods and Generals
 Name: original_title, dtype: object,
 '3': 768    Winnie the Pooh
 Name: original_title, dtype: object,
 '4': 109.6585494970884,
 '5': 107,
 '6': 239    Avatar
 Name: original_title, dtype: object}

# 7. Какой фильм самый убыточный?

In [74]:
answ = data[data.profit == data.profit.min()]
answers['7'] =answ.original_title
answers

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit
1245,tt1210819,255000000,89289910,The Lone Ranger,Johnny Depp|Armie Hammer|William Fichtner|Hele...,Gore Verbinski,Never Take Off the Mask,The Texas Rangers chase down a gang of outlaws...,149,Action|Adventure|Western,Walt Disney Pictures|Jerry Bruckheimer Films|I...,7/3/2013,6.0,2013,-165710090

# 8. У скольких фильмов из датасета объем сборов оказался выше бюджета?

In [76]:
answ = data[data.profit > 0]
answers['8'] =len(answ)
answers

{'1': 723    Pirates of the Caribbean: On Stranger Tides
 Name: original_title, dtype: object,
 '2': 1157    Gods and Generals
 Name: original_title, dtype: object,
 '3': 768    Winnie the Pooh
 Name: original_title, dtype: object,
 '4': 109.6585494970884,
 '5': 107,
 '6': 239    Avatar
 Name: original_title, dtype: object,
 '7': 1245    The Lone Ranger
 Name: original_title, dtype: object,
 '8': 1478}

# 9. Какой фильм оказался самым кассовым в 2008 году?

In [78]:
data2 = data[data.release_year == 2008]
answ = data2[data2.revenue == data2.revenue.max()]
answers['9'] =answ.original_title
answers

{'1': 723    Pirates of the Caribbean: On Stranger Tides
 Name: original_title, dtype: object,
 '2': 1157    Gods and Generals
 Name: original_title, dtype: object,
 '3': 768    Winnie the Pooh
 Name: original_title, dtype: object,
 '4': 109.6585494970884,
 '5': 107,
 '6': 239    Avatar
 Name: original_title, dtype: object,
 '7': 1245    The Lone Ranger
 Name: original_title, dtype: object,
 '8': 1478,
 '9': 599    The Dark Knight
 Name: original_title, dtype: object}

# 10. Самый убыточный фильм за период с 2012 по 2014 г. (включительно)?

In [80]:
data2 = data[(data.release_year > 2011) & (data.release_year < 2015)]
answ = data2[data2.profit == data2.profit.min()]
answers['10'] =answ.original_title
answers

{'1': 723    Pirates of the Caribbean: On Stranger Tides
 Name: original_title, dtype: object,
 '2': 1157    Gods and Generals
 Name: original_title, dtype: object,
 '3': 768    Winnie the Pooh
 Name: original_title, dtype: object,
 '4': 109.6585494970884,
 '5': 107,
 '6': 239    Avatar
 Name: original_title, dtype: object,
 '7': 1245    The Lone Ranger
 Name: original_title, dtype: object,
 '8': 1478,
 '9': 599    The Dark Knight
 Name: original_title, dtype: object,
 '10': 1245    The Lone Ranger
 Name: original_title, dtype: object}

# 11. Какого жанра фильмов больше всего?

In [86]:
# эту задачу тоже можно решать разными подходами, попробуй реализовать разные варианты
# если будешь добавлять функцию - выноси ее в предобработку что в начале


diction = counts(data.genres)

In [98]:
print(diction)
keys = []
vals = []
for key, values in diction.items():
    keys.append(key)
    vals.append(values)
gens = pd.DataFrame({'genres': keys, 'value' : vals})
genmax = gens[gens.value == gens.value.max()]
genmax

{'Action': 582, 'Adventure': 415, 'Science Fiction': 248, 'Thriller': 596, 'Fantasy': 222, 'Crime': 315, 'Western': 19, 'Drama': 782, 'Family': 260, 'Animation': 139, 'Comedy': 683, 'Mystery': 168, 'Romance': 308, 'War': 58, 'History': 62, 'Music': 64, 'Horror': 176, 'Documentary': 8, 'Foreign': 2}

  genres  value
7  Drama    782

In [99]:
answers['11'] =genmax.genres
answers

{'1': 723    Pirates of the Caribbean: On Stranger Tides
 Name: original_title, dtype: object,
 '2': 1157    Gods and Generals
 Name: original_title, dtype: object,
 '3': 768    Winnie the Pooh
 Name: original_title, dtype: object,
 '4': 109.6585494970884,
 '5': 107,
 '6': 239    Avatar
 Name: original_title, dtype: object,
 '7': 1245    The Lone Ranger
 Name: original_title, dtype: object,
 '8': 1478,
 '9': 599    The Dark Knight
 Name: original_title, dtype: object,
 '10': 1245    The Lone Ranger
 Name: original_title, dtype: object,
 '11': 7    Drama
 Name: genres, dtype: object}

ВАРИАНТ 2

# 12. Фильмы какого жанра чаще всего становятся прибыльными?

In [101]:
dataprofited = data[data.profit > 0]
dicdprofited = counts(dataprofited.genres)
print(dicdprofited)
keys = []
vals = []
for key, values in dicdprofited.items():
    keys.append(key)
    vals.append(values)
gens = pd.DataFrame({'genres': keys, 'value' : vals})
genmax = gens[gens.value == gens.value.max()]
genmax

{'Action': 444, 'Adventure': 337, 'Science Fiction': 195, 'Thriller': 446, 'Fantasy': 188, 'Crime': 231, 'Western': 12, 'Drama': 560, 'Family': 226, 'Animation': 120, 'Comedy': 551, 'Mystery': 119, 'Romance': 242, 'War': 41, 'History': 46, 'Music': 47, 'Horror': 150, 'Documentary': 7}

  genres  value
7  Drama    560

In [102]:
answers['12'] =genmax.genres
answers

{'1': 723    Pirates of the Caribbean: On Stranger Tides
 Name: original_title, dtype: object,
 '2': 1157    Gods and Generals
 Name: original_title, dtype: object,
 '3': 768    Winnie the Pooh
 Name: original_title, dtype: object,
 '4': 109.6585494970884,
 '5': 107,
 '6': 239    Avatar
 Name: original_title, dtype: object,
 '7': 1245    The Lone Ranger
 Name: original_title, dtype: object,
 '8': 1478,
 '9': 599    The Dark Knight
 Name: original_title, dtype: object,
 '10': 1245    The Lone Ranger
 Name: original_title, dtype: object,
 '11': 7    Drama
 Name: genres, dtype: object,
 '12': 7    Drama
 Name: genres, dtype: object}

# 13. У какого режиссера самые большие суммарные кассовые сборы?

In [103]:
data.sample(1)

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit
976,tt0903624,250000000,1017003568,The Hobbit: An Unexpected Journey,Ian McKellen|Martin Freeman|Richard Armitage|A...,Peter Jackson,From the smallest beginnings come the greatest...,"Bilbo Baggins, a hobbit enjoying his quiet lif...",169,Adventure|Fantasy|Action,WingNut Films|New Line Cinema|Metro-Goldwyn-Ma...,11/26/2012,6.9,2012,767003568

In [116]:
ss = summ(data, 'director', 'revenue')
ss
keys = []
vals = []
for key, values in ss.items():
    keys.append(key)
    vals.append(values)
d_sums = pd.DataFrame({'director': keys, 'value' : vals})
d_sum_max = d_sums[d_sums.value == d_sums.value.max()]
d_sum_max

          director       value
122  Peter Jackson  6490593685

In [119]:
answers['13'] =d_sum_max.director
answers

{'1': 723    Pirates of the Caribbean: On Stranger Tides
 Name: original_title, dtype: object,
 '2': 1157    Gods and Generals
 Name: original_title, dtype: object,
 '3': 768    Winnie the Pooh
 Name: original_title, dtype: object,
 '4': 109.6585494970884,
 '5': 107,
 '6': 239    Avatar
 Name: original_title, dtype: object,
 '7': 1245    The Lone Ranger
 Name: original_title, dtype: object,
 '8': 1478,
 '9': 599    The Dark Knight
 Name: original_title, dtype: object,
 '10': 1245    The Lone Ranger
 Name: original_title, dtype: object,
 '11': 7    Drama
 Name: genres, dtype: object,
 '12': 7    Drama
 Name: genres, dtype: object,
 '13': 122    Peter Jackson
 Name: director, dtype: object}

# 14. Какой режисер снял больше всего фильмов в стиле Action?

In [142]:
data_Action = data[data.genres.str.contains('Action')]

diction = counts(data_Action.director)

keys = []
vals = []
for key, values in diction.items():
    keys.append(key)
    vals.append(values)
dirs = pd.DataFrame({'director': keys, 'value' : vals})
dirmax = dirs[dirs.value == dirs.value.max()]
dirmax

             director  value
123  Robert Rodriguez      9

In [143]:
answers['14'] =dirmax.director
answers['14']

123    Robert Rodriguez
Name: director, dtype: object

# 15. Фильмы с каким актером принесли самые высокие кассовые сборы в 2012 году?

In [150]:
data2012 = data[data.release_year == 2012]
acts = el_sum(data2012, 'cast', 'revenue')

keys = []
vals = []
for key, values in acts.items():
    keys.append(key)
    vals.append(values)
acts = pd.DataFrame({'actor': keys, 'value' : vals})
actmax = acts[acts.value == acts.value.max()]
actmax

             actor       value
3  Chris Hemsworth  2027450773

In [151]:
answers['15'] =actmax.actor
answers['15']

3    Chris Hemsworth
Name: actor, dtype: object

# 16. Какой актер снялся в большем количестве высокобюджетных фильмов?

In [155]:
databud = data[data.budget > data.budget.mean()]
dic = counts(databud.cast)
keys = []
vals = []
for key, values in dic.items():
    keys.append(key)
    vals.append(values)
a_sums = pd.DataFrame({'actor': keys, 'value' : vals})
a_sum_max = a_sums[a_sums.value == a_sums.value.max()]
a_sum_max

         actor  value
34  Matt Damon     18

In [156]:
answers['16'] =a_sum_max.actor
answers['16']

34    Matt Damon
Name: actor, dtype: object

# 17. В фильмах какого жанра больше всего снимался Nicolas Cage?

In [158]:
datanc = data[data.cast.str.contains('Nicolas Cage')]
dic = counts(datanc.genres)
dic

{'Thriller': 15,
 'Action': 17,
 'Science Fiction': 4,
 'Adventure': 7,
 'Drama': 12,
 'Mystery': 3,
 'Crime': 10,
 'Animation': 3,
 'Family': 3,
 'Fantasy': 8,
 'Comedy': 6,
 'History': 2,
 'War': 1,
 'Horror': 1,
 'Romance': 1}

In [160]:
keys = []
vals = []
for key, values in dic.items():
    keys.append(key)
    vals.append(values)
gens = pd.DataFrame({'genres': keys, 'value' : vals})
genmax = gens[gens.value == gens.value.max()]
genmax

   genres  value
1  Action     17

In [162]:
answers['17'] =genmax.genres
answers['17']

1    Action
Name: genres, dtype: object

# 18. Самый убыточный фильм от Paramount Pictures

In [167]:
datapp =data[data.production_companies.str.contains('Paramount Pictures')]
datappmin = datapp[datapp.profit == datapp.profit.min()]

answers['18'] =datappmin.original_title
answers['18']

925    K-19: The Widowmaker
Name: original_title, dtype: object

# 19. Какой год стал самым успешным по суммарным кассовым сборам?

In [169]:
dic = summ(data, 'release_year', 'profit')

keys = []
vals = []
for key, values in dic.items():
    keys.append(key)
    vals.append(values)
gens = pd.DataFrame({'year': keys, 'value' : vals})
genmax = gens[gens.value == gens.value.max()]
genmax

   year        value
0  2015  18668572378

In [170]:
answers['19'] =genmax.year
answers['19']

0    2015
Name: year, dtype: int64

# 20. Какой самый прибыльный год для студии Warner Bros?

In [171]:
datawb = data[data.production_companies.str.contains('Warner Bros')]
dic = summ(datawb, 'release_year', 'profit')

keys = []
vals = []
for key, values in dic.items():
    keys.append(key)
    vals.append(values)
gens = pd.DataFrame({'year': keys, 'value' : vals})
genmax = gens[gens.value == gens.value.max()]
genmax

   year       value
1  2014  2295464519

In [172]:
answers['20'] =genmax.year
answers['20']

1    2014
Name: year, dtype: int64

# 21. В каком месяце за все годы суммарно вышло больше всего фильмов?

In [180]:
dic = counts(data.month)
keys = []
vals = []
for key, values in dic.items():
    keys.append(key)
    vals.append(values)
months = pd.DataFrame({'month': keys, 'value' : vals})
monmax = months[months.value == months.value.max()]
monmax

  month  value
5     9    227

In [181]:
answers['21'] =monmax.month
answers['21']

5    9
Name: month, dtype: object

# 22. Сколько суммарно вышло фильмов летом? (за июнь, июль, август)

In [194]:
data['month'] =data['month'].astype(int)
datasmmr = data[(data.month > 5) & (data.month < 9 ) ]

In [196]:
answers['22'] =len(datasmmr)
answers['22']

450

# 23. Для какого режиссера зима – самое продуктивное время года?

In [200]:
datawntr = data[(data.month > 11) | (data.month < 3 ) ]
diction = counts(datawntr.director)

keys = []
vals = []
for key, values in diction.items():
    keys.append(key)
    vals.append(values)
dirs = pd.DataFrame({'director': keys, 'value' : vals})
dirmax = dirs[dirs.value == dirs.value.max()]

         director  value
23  Peter Jackson      7

In [214]:
answers['23'] =dirmax.director
answers['23']

23    Peter Jackson
Name: director, dtype: object

# 24. Какая студия дает самые длинные названия своим фильмам по количеству символов?

In [205]:
data.sample(1)

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit,month,namelenght
1484,tt0758794,65000000,43545364,We Are Marshall,Matthew McConaughey|Matthew Fox|Anthony Mackie...,McG,From the ashes we rose.,When a plane crash claims the lives of members...,124,Drama,Legendary Pictures|Thunder Road Pictures|Wonde...,12/12/2006,6.5,2006,-21454636,12,15

In [209]:
a = df_el1_el2(data, 'production_companies', 'namelenght')

In [215]:
keys = []
vals = []
for key, values in a.items():
    keys.append(key)
    vals.append(values)
meanl = pd.DataFrame({'companie': keys, 'lenght' : vals})
meanlmax = meanl[meanl.lenght == meanl.lenght.max()]
answers['24'] =meanlmax.companie
answers['24']

1505    Four By Two Productions
Name: companie, dtype: object

# 25. Описание фильмов какой студии в среднем самые длинные по количеству слов?

In [233]:
# количество эл-ов в s2 для каждого эл-та s1 в df

a = count_s2_numbers(data, 'production_companies', 'overview')

In [234]:
keys = []
vals = []
for key, values in a.items():
    keys.append(key)
    vals.append(values)
meanl = pd.DataFrame({'companie': keys, 'lenght' : vals})
meanlmax = meanl[meanl.lenght == meanl.lenght.max()]
answers['25'] =meanlmax.companie
answers['25']

950    Midnight Picture Show
Name: companie, dtype: object

# 26. Какие фильмы входят в 1 процент лучших по рейтингу? 
по vote_average

In [270]:
datasv = data.sort_values(by =['vote_average'] , ascending=False ).reset_index()
filmlist = ['Inside Out', 'The Dark Knight', '12 Years a Slave',
'BloodRayne', 'The Adventures of Rocky & Bullwinkle',
'Batman Begins', 'The Lord of the Rings: The Return of the King', 'Upside Down',
'300', 'Lucky Number Slevin', 'Kill Bill: Vol. 1',
'Upside Down', 'Inside Out', 'Iron Man']
shape = datasv.shape
perc = (int(shape[0]) // 100) +1

datasv = datasv.iloc[0:perc]

data2= pd.DataFrame()
for i in range(len(filmlist)):
    data2= pd.concat([data2,(datasv[datasv.original_title == filmlist[i]])])
    
answ = []    
data2.drop_duplicates(subset='original_title', keep ='first', inplace = True)
for i in range(data2.shape[0]):
    answ.append(data2.iloc[i].original_title)
    
answers['26'] =answ
answers['26']

['Inside Out',
 'The Dark Knight',
 '12 Years a Slave',
 'The Lord of the Rings: The Return of the King']

# 27. Какие актеры чаще всего снимаются в одном фильме вместе?

ВАРИАНТ 2

In [343]:
a = dic_with_pairs(data, 'cast')

In [346]:
answers['27'] =a
answers['27']

'Daniel RadcliffeRupert Grint'

# Submission

In [347]:
# в конце можно посмотреть свои ответы к каждому вопросу
answers

{'1': 723    Pirates of the Caribbean: On Stranger Tides
 Name: original_title, dtype: object,
 '2': 1157    Gods and Generals
 Name: original_title, dtype: object,
 '3': 768    Winnie the Pooh
 Name: original_title, dtype: object,
 '4': 109.6585494970884,
 '5': 107,
 '6': 239    Avatar
 Name: original_title, dtype: object,
 '7': 1245    The Lone Ranger
 Name: original_title, dtype: object,
 '8': 1478,
 '9': 599    The Dark Knight
 Name: original_title, dtype: object,
 '10': 1245    The Lone Ranger
 Name: original_title, dtype: object,
 '11': 7    Drama
 Name: genres, dtype: object,
 '12': 7    Drama
 Name: genres, dtype: object,
 '13': 122    Peter Jackson
 Name: director, dtype: object,
 '14': 123    Robert Rodriguez
 Name: director, dtype: object,
 '15': 3    Chris Hemsworth
 Name: actor, dtype: object,
 '16': 34    Matt Damon
 Name: actor, dtype: object,
 '17': 1    Action
 Name: genres, dtype: object,
 '18': 925    K-19: The Widowmaker
 Name: original_title, dtype: object,
 '19': 0    2015
 Name: year, dtype: int64,
 '20': 1    2014
 Name: year, dtype: int64,
 '21': 5    9
 Name: month, dtype: object,
 '22': 450,
 '23': 23    Peter Jackson
 Name: director, dtype: object,
 '24': 1505    Four By Two Productions
 Name: companie, dtype: object,
 '25': 950    Midnight Picture Show
 Name: companie, dtype: object,
 '26': ['Inside Out',
  'The Dark Knight',
  '12 Years a Slave',
  'The Lord of the Rings: The Return of the King'],
 '27': 'Daniel RadcliffeRupert Grint'}

In [348]:
# и убедиться что ни чего не пропустил)
len(answers)

27